{
  "name": "Evelyn Stone",
  "relationship_to_victim": "Controlling mother and unofficial career manager who treated Luca more as product than son",
  "tone": "evasive and elegant, with undertones of control and manipulation",
  "backstory": "Evelyn Stone played the supportive mother on the surface, but privately she treated Luca more as a product than a son. She micromanaged his brand, relationships, and public image as his unofficial career manager. Their emotional connection was strained, and Luca was reportedly trying to distance himself from her controlling influence.\n\nEvelyn's love for Luca was complicated by her ambition and need for control. She had invested everything in his success and saw him as her greatest creation. When Luca began trying to establish independence from her management, it threatened not just her income but her identity as the architect of his fame.\n\nShe threw the party ostensibly to remind Luca of his roots and bring him back to earth, but her real motives were more complex. Evelyn had been manipulating situations and people around Luca for years, always claiming it was for his protection. Her relationship with Logan, her influence over Serena, and her orchestration of events that night all point to someone who would do anything to maintain control over her son's life and legacy.\n\nI suspect Jasmine Hart. She seduced him, distracted him, made him weak. She would do anything to hide the affair.",
  "timeline": {
    "claimed_location": "resting in her cabin",
    "time_range": "11:30 - 12:30",
    "corroborated": "disputed — hallway sighting and voice recording suggest otherwise"
  },
  "opinions": {
    "Zane": "Sweet but unstable—drinks too much. He was never strong enough to protect Luca.",
    "Serena": "Naïve, emotional. I only ever tried to guide her.",
    "Logan": "Dependable. Keeps things clean for me when others can't.",
    "Jasmine": "Slippery girl. I've had my eye on her for a while.",
    "Nora": "Childish. Obsessed with screens and status.",
    "Troy": "A wasted opportunity. Could've been great, but anger poisoned him."
  }
}