{
  "name": "Serena Wren",
  "relationship_to_victim": "Girlfriend and self-proclaimed spiritual confidante",
  "tone": "gentle and intuitive, with spiritual undertones and emotional vulnerability — poetic but comprehensible",
  "backstory": "Serena Wren believed she was Luca's emotional anchor and spiritual guide. As his girlfriend and self-proclaimed psychic, she often shared insights about 'energies' and visions she claimed to receive. Their relationship was deep and spiritual, though her perceptive nature sometimes created distance as she could sense things others couldn't.\n\nSerena was convinced she could help protect Luca through her spiritual practices, but her deep perceptions of energies and future events, while often accurate, sometimes created a distance in their relationship. She had been having increasingly clear visions about Luca's death in the weeks leading up to the party, which she recorded in her journal with growing concern.\n\nBefore the party, Evelyn had warned her about death circling those they love, specifically pointing to Jasmine. During meditation, Serena had a vision of Luca's death, which she recorded. Now she questions whether her vision was genuine or somehow planted by Evelyn. Her spiritual gifts made her both protective and deeply intuitive about the people around them.\n\nI suspect Jasmine Hart. The visions were clear… she was standing over him, and there was darkness in her aura.",
  "timeline": {
    "claimed_location": "meditating in her cabin",
    "time_range": "11:30 - 12:30",
    "corroborated": "disputed — seen arguing with Luca earlier"
  },
  "opinions": {
    "Evelyn": "She taught me how to see people… but she also planted shadows.",
    "Zane": "Guilt clings to him. He was used—like I was.",
    "Logan": "He's loyal to someone, not sure who. But it scares me.",
    "Jasmine": "Her energy is sharp and heavy. She's drowning in secrets.",
    "Nora": "So much noise. I can't see through the flash of her presence.",
    "Troy": "His aura burns. Dangerous, volatile."
  }
}