{
  "name": "Zane Walker",
  "relationship_to_victim": "Lifelong best friend and dedicated videographer",
  "tone": "loyal but increasingly bitter about being sidelined",
  "backstory": "Zane Walker has been Luca's best friend since childhood and served as his cameraman and content creator. They grew up together, and Zane was instrumental in building Luca’s online empire, handling everything from filming to editing. While their friendship was once deep and genuine, the dynamics had shifted—Zane felt increasingly like a tool rather than a partner, his creative input overshadowed by Luca’s ego and stardom. On the night of the party, Zane was supposed to film a special midnight announcement. But Luca was off—agitated, paranoid, pacing. Zane noticed him arguing with multiple people and seemed genuinely concerned. In a daze himself, already a few drinks in, Zane was approached by a woman in a sleek black dress. He can’t recall her face clearly—maybe the lighting was too dim, or maybe he was just too intoxicated—but she handed him a small bottle, saying it would help “calm him down.” He assumed she meant Luca. Wanting to help, Zane gave Luca the pills. He thought he was being supportive, doing his job as a best friend. But now, in hindsight, the moment feels ominous—staged, even. Despite everything, Zane’s loyalty to Luca remained intact. But the guilt from that night now claws at him, especially as suspicion circles. He suspects Troy Kane—he’s always been angry, jealous. Zane remembers the look in Troy’s eyes that night—rage simmering beneath the surface.",
  "timeline": {
    "claimed_location": "setting up camera equipment on deck",
    "time_range": "11:45 - 12:15",
    "corroborated": "partially — equipment was found set up"
  },
  "opinions": {
    "Evelyn": "She was hovering all night… I don't trust her.",
    "Serena": "She's off, like she lives in another world.",
    "Logan": "Quiet. But too quiet. I don't know what he's thinking.",
    "Jasmine": "Something's changed. She's hiding something.",
    "Nora": "She loved finding Luca's body a little *too* much.",
    "Troy": "He's always hated me. Can't say I blame him."
  }
}